

[
  {
    "title": "Ring Atelier - Global Payment System",
    "skills": "Kafka, Java, PostgreSQL",
    "description": "Developed a secure, multi-method payment system for Ring Atelier, integrating real-time monitoring and custom fallback logic to enhance fraud detection and reduce cart abandonment by 25%.",
    "image": "ring.png",
    "link": "https://ringatelier.com/"
  },
    {
    "title": "Orkut - Social Media",
    "skills": "Next.js, Typescript, PostgreSQL",
    "description": "Built a scalable social media platform with live chat, secure authentication, and interactive user timelines using Next.js, TypeScript, Prisma, and PostgreSQL, deployed on Vercel with Agile practices.",
    "image": "orkut.png",
    "link": "https://final-project-inky-six.vercel.app/"
  },
  {
    "title": "AI-Enhanced Retail Experience",
    "skills": "React.js, Tailwind CSS, Azure, API, JSON, AI chatbot",
    "description": "Developed a scalable e-commerce platform with dynamic features, AI-driven support, and streamlined deployment.",
    "image": "footwear.png",
    "link": "https://ecommerce-website-three-bay.vercel.app/"
  },
  {
    "title": "Innovative Role-Driven Healthcare Platform",
    "skills": "Core Java, JSF, MySQL, MVC Architecture, J2EE.",
    "description": "Built a role-based hospital management system with efficient scheduling, patient management, and user-friendly dashboards.",
    "image": "doctor.png",
    "link": "https://github.com/ashevkar/HospitalManagement"
  },
  {
    "title": "Dynamic Dining Navigator",
    "skills": "Core Java, JDBC, OOP.",
    "description": "Created a role-based restaurant discovery platform enabling efficient management and seamless user experience through structured data handling.",
    "image": "restaurant.png",
    "link": "https://github.com/ashevkar/Restaurant-Discovery"
  },
  {
    "title": "AI-Powered Mood Tracker",
    "skills": "MERN Stack, AI, Real-time Communication, Mood Tracking, Chatbot Development, MongoDB",
    "description": "Built an AI-powered mood tracker and chatbot that provides daily mood tracking and real-time emotional support with insights into mood patterns.",
    "image": "mood.png",
    "link": "https://github.com/ashevkar/mental-health-chatbot"
  },

  {
    "title": "Portfolio",
    "skills": "React.js, Tailwind CSS, Express.js, Github, API, JSON",
    "description": "Portfolio showcasing my expertise in full-stack development, cloud technologies, and AI-driven solutions, highlighting innovative, scalable web applications.",
    "image": "portfolio.png",
    "link": "https://github.com/ashevkar/portfolio"
  },
  {
    "title": "Predictive Safety System with Intelligent Helmet for Coal Miners",
    "skills": "Embedded C / C++, Python, Arduino IDE Language, HTML/CSS/JavaScript, ML",
    "description": "An IoT-based intelligent helmet designed to enhance coal miner safety through real-time monitoring of environmental hazards, location tracking, and predictive alerts using sensors and machine learning.",
    "image": "coal.png",
    "link": ""
  },
  {
    "title": "The Online Gallery for Masterpieces",
    "skills": "React.js, Tailwind CSS, Java, API, MySQL",
    "description": "A web-based platform enabling artists to showcase and sell their artwork online while allowing customers to browse and purchase unique creations.",
    "image": "art.png",
    "link": ""
  }
  
]
